DataProcessors/ГрупповоеПерепроведениеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<DataProcessor>
		<Properties>
			<Name>ГрупповоеПерепроведениеДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Транзакция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФоновоеВыполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресХранилища</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ГрупповоеПерепроведениеДокументов/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Для Каждого Строка Из ВидыДокументов Цикл
		Строка.Найден = Ложь;
	КонецЦикла;
	
	Для Каждого ОбъектМетаданных Из Метаданные.Документы Цикл
		Если ОбъектМетаданных.Имя = "РегламентнаяОперация" Тогда
			Продолжить;
		КонецЕсли;
		
		Строки = ВидыДокументов.НайтиСтроки(Новый Структура("Имя", ОбъектМетаданных.Имя));
		Если Строки.Количество() > 0 Тогда
			Строка = Строки[0];
		Иначе
			Строка = ВидыДокументов.Добавить();
		КонецЕсли;
		
		Строка.Найден = Истина;
		Строка.Имя = ОбъектМетаданных.Имя;
		Строка.Представление = ОбъектМетаданных.Синоним;
	КонецЦикла;
	
	НеНайденные = ВидыДокументов.НайтиСтроки(Новый Структура("Найден", Ложь));
	Для Каждого Строка Из НеНайденные Цикл
		ВидыДокументов.Удалить(Строка);
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.ИдентификаторЗадания) Тогда
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.ИдентификаторЗадания) Тогда
		Если Вопрос("Идет переобработка документов. Остановить?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
			ОстановитьФоновоеВыполнение();
		Иначе
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	АктивныеВидыДокументов = Новый Массив;
	Для Каждого АктивныйВидДокумента Из ВидыДокументов.НайтиСтроки(Новый Структура("Активный", Истина)) Цикл
		АктивныеВидыДокументов.Добавить(Новый Структура("Имя", АктивныйВидДокумента.Имя));
	КонецЦикла;
	
	Если АктивныеВидыДокументов.Количество() = 0 Тогда
		Предупреждение("Не выбран ни один вид документа.");
		
		Возврат;
	КонецЕсли;
	
	Если Объект.ФоновоеВыполнение Тогда
		ЗапуститьФоновоеВыполнение();
		
		ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Истина);
	Иначе
		Счетчик = 0;
		
		ДокументыЗаПериод = ПерепроведениеДокументов.ПолучитьДокументыЗаПериод(Объект.Период, АктивныеВидыДокументов);
		Если ДокументыЗаПериод.Количество() > 0 Тогда
            Для Каждого ДокументЗаПериод Из ДокументыЗаПериод Цикл
				Если ДокументЗаПериод.Уровень = 1 Тогда
					ЗаписатьДокумент(ДокументЗаПериод.Документ);

					Счетчик = Счетчик + 1;
					
					ТекущийПрогресс = Окр(Счетчик * 100 / ДокументыЗаПериод.Количество(), 2);
					
					Элементы.ТекущееСообщение.Заголовок = СокрЛП(ДокументЗаПериод.Документ);
					
					ОбработкаПрерыванияПользователя();
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		Предупреждение("Обработано документов: " + Строка(ДокументыЗаПериод.Количество()));
		
		Счетчик = 0;
		
		ТекущийПрогресс = 0;
		
		Элементы.ТекущееСообщение.Заголовок = "";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура КомандаОстановить(Команда)
	ОстановитьФоновоеВыполнение();
КонецПроцедуры

&НаСервере
Процедура ЗапуститьФоновоеВыполнениеНаСервере()
	Объект.АдресХранилища = ПоместитьВоВременноеХранилище(Новый Структура("Прогресс,Документ", 0), ЭтаФорма.УникальныйИдентификатор);
	
	АктивныеВидыДокументов = Новый Массив;
	Для Каждого АктивныйВидДокумента Из ВидыДокументов.НайтиСтроки(Новый Структура("Активный", Истина)) Цикл
		АктивныеВидыДокументов.Добавить(Новый Структура("Имя", АктивныйВидДокумента.Имя));
	КонецЦикла;
	
	ПараметрыЗадания = Новый Массив;
	ПараметрыЗадания.Добавить(Объект.Период);
	ПараметрыЗадания.Добавить(АктивныеВидыДокументов);
	ПараметрыЗадания.Добавить(Объект.Транзакция);
	ПараметрыЗадания.Добавить(Объект.АдресХранилища);
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ПерепроведениеДокументов.Запустить", ПараметрыЗадания);
	
	Объект.ИдентификаторЗадания = ФоновоеЗадание.УникальныйИдентификатор;
КонецПроцедуры

&НаСервере
Процедура ЗапуститьФоновоеВыполнение()
	ЗапуститьФоновоеВыполнениеНаСервере();
	
	Элементы.Период.ТолькоПросмотр = Истина;
	Элементы.Транзакция.ТолькоПросмотр = Истина;
	Элементы.ФоновоеВыполнение.ТолькоПросмотр = Истина;
	Элементы.ВидыДокументов.ТолькоПросмотр = Истина;
	Элементы.ФормаКомандаВыполнить.Доступность = Ложь;
	Элементы.ФормаКомандаОстановить.Доступность = Истина;
КонецПроцедуры

&НаСервере
Процедура ОстановитьФоновоеВыполнениеНаСервере()
	Если ЗначениеЗаполнено(Объект.ИдентификаторЗадания) Тогда
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Объект.ИдентификаторЗадания);
		
		ФоновоеЗадание.Отменить();
		
		Объект.ИдентификаторЗадания = Неопределено;
		
		УдалитьИзВременногоХранилища(Объект.АдресХранилища);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстановитьФоновоеВыполнение()
	ОстановитьФоновоеВыполнениеНаСервере();
	
	ТекущийПрогресс = 0;
	
	Элементы.ТекущееСообщение.Заголовок = "";
	
	Элементы.Период.ТолькоПросмотр = Ложь;
	Элементы.Транзакция.ТолькоПросмотр = Ложь;
	Элементы.ФоновоеВыполнение.ТолькоПросмотр = Ложь;
	Элементы.ВидыДокументов.ТолькоПросмотр = Ложь;
	Элементы.ФормаКомандаВыполнить.Доступность = Истина;
	Элементы.ФормаКомандаОстановить.Доступность = Ложь;
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьВыполнениеЗадания()
	Попытка
		ПараметрыВыполнения = ПолучитьИзВременногоХранилища(Объект.АдресХранилища);
		
		Если ПараметрыВыполнения = Неопределено Тогда
			Предупреждение("Задание отменено пользователем.");
		Иначе
			Если ПараметрыВыполнения.Свойство("Ошибка") Тогда
				ВызватьИсключение ПараметрыВыполнения.Ошибка;
			Иначе
				ТекущийПрогресс = ПараметрыВыполнения.Прогресс;
				
				Элементы.ТекущееСообщение.Заголовок = ПараметрыВыполнения.Документ;
				
				Если ПараметрыВыполнения.Прогресс < 100 Тогда
					ПодключитьОбработчикОжидания("ПроверитьВыполнениеЗадания", 1, Истина);
				Иначе
					ОстановитьФоновоеВыполнение();
					
					Предупреждение("Обработано документов: " + Строка(ПараметрыВыполнения.Количество));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	Исключение
		ОстановитьФоновоеВыполнение();
		
		ВызватьИсключение;
	КонецПопытки;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДокумент(Документ)
	ДокументОбъект = Документ.ПолучитьОбъект();
	ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыОтметитьВсе(Команда)
	Для Каждого Строка Из ВидыДокументов Цикл
		Строка.Активный = Истина;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументыСнятьВсе(Команда)
	Для Каждого Строка Из ВидыДокументов Цикл
		Строка.Активный = Ложь;
	КонецЦикла;
КонецПроцедуры
